{
  "8032858371": {
    "info": {
      "uri": "8032858371",
      "lang": "eng",
      "isDuplicate": false,
      "date": "2024-03-17",
      "time": "06:54:08",
      "dateTime": "2024-03-17T06:54:08Z",
      "dateTimePub": "2024-03-17T06:53:13Z",
      "dataType": "news",
      "sim": 0.7529411911964417,
      "url": "https://www.dailyexpress.com.my/news/230759/pence-declines-to-endorse-trump-/",
      "title": "Pence declines to endorse Trump",
      "body": "WASHINGTON: Former US vice president Mike Pence said that he would not be backing Donald Trump as his old boss runs for a second term in the White House.\n\n\"It should come as no surprise that I will not be endorsing Donald Trump this year,\" Pence said in an interview with Fox News.\n\nADVERTISEMENT\n\nUS media called the announcement a \"bombshell\" and \"startling,\" although in reality deep divisions have driven the two men apart since leaving office, and an endorsement would have been a surprise.\n\nThe pair became estranged after Trump tried to pressure Pence to help him overturn his 2020 election defeat to Joe Biden, repeatedly attacking him on social media when he wouldn't go along with the scheme.\n\nSPONSORED CONTENT Sabah revenue hits RM6.97 billion: Hajiji says GRS State Government may see full term Kota Kinabalu: The Sabah Government continued its momentum in managing the economy in line with the commitment and spirit of the Sabah Maju Jaya (SMJ) when it posted record high state revenue of RM6.973 billion last year. Read more After various attempts by Trump and his allies to subvert the election results failed, the then-president directed a mob of his supporters to march on the Capitol, where they ransacked the building as some chanted \"Hang Mike Pence!\"\n\nPence told Fox News that Trump was \"pursuing and articulating an agenda that is at odds with the conservative agenda that we governed on during our four years.\"\n\nADVERTISEMENT\n\nThe 64-year-old's comments come days after Trump secured enough delegates to clinch the Republican nomination to challenge Biden in November.\n\nPence was one of Trump's early rivals in the primary contest ahead of the 2024 election, although he quit the race last October after failing to poll in double figures.\n\nADVERTISEMENT\n\nPence did not offer an alternative endorsement -- there are several third-party candidates running -- and said he would never vote for Biden, who secured the Democratic nomination this week.\n\nPence gave Trump years of unswervingly loyal service before the insurrection in Washington.\n\nBut he called the president's actions on January 6, 2021, \"reckless\" and said they \"endangered me and my family.\"\n\nTrump had demanded Pence, a former governor of Indiana, to derail the congressional certification of Biden's electoral victory.\n\nPence refused, gaining the enmity of Trump's diehard followers and becoming persona non grata within the hard right \"Make America Great Again\" movement.\n\nThe evangelical Christian also received unwelcome headlines after leaving office over an FBI search of his home -- part of a wider Washington scandal over mishandled classified documents -- and a subpoena to testify before a federal probe into the Capitol riot, which he resisted.\n\nHe defended the record of the 2017-21 Trump administration in his Fox News interview, saying he was \"incredibly proud\" of its achievements.\n\n\"It was a conservative record that made America more prosperous, more secure, and saw conservatives appointed to our courts in a more peaceful world,\" he said.\n\n\"But that being said, during my presidential campaign I made clear there were profound differences between me and President Trump on a range of issues.\"\n\nStay up-to-date by following Daily Express's Telegram channel.\n\nDaily Express Malaysia\n\n* Follow us on Instagram and join our Telegram and/or WhatsApp channel(s) for the latest news you don't want to miss.\n\n* Do you have access to the Daily Express e-paper and online exclusive news? Check out subscription plans available.",
      "source": {
        "uri": "dailyexpress.com.my",
        "dataType": "news",
        "title": "Daily Express Sabah"
      },
      "authors": [],
      "categories": [
        {
          "uri": "dmoz/Society/Issues/Warfare_and_Conflict",
          "label": "dmoz/Society/Issues/Warfare and Conflict",
          "wgt": 100
        },
        {
          "uri": "dmoz/Society/Issues/Business",
          "label": "dmoz/Society/Issues/Business",
          "wgt": 100
        },
        {
          "uri": "dmoz/Society/Activism/Media",
          "label": "dmoz/Society/Activism/Media",
          "wgt": 100
        },
        {
          "uri": "dmoz/Society/Advice",
          "label": "dmoz/Society/Advice",
          "wgt": 100
        },
        {
          "uri": "news/Politics",
          "label": "news/Politics",
          "wgt": 98
        }
      ],
      "videos": [
        {
          "uri": "https://www.youtube.com/embed/videoseries?list=PLFQLhfzqv1LWm48mCiPz24JTaIdnWo3ec",
          "label": ""
        },
        {
          "uri": "https://www.youtube.com/embed/videoseries?list=PLFQLhfzqv1LWvAHmG_8bMJokW4aKIhHWW",
          "label": ""
        },
        {
          "uri": "https://www.youtube.com/embed/ChWq0-gfALM",
          "label": ""
        }
      ],
      "image": "https://www.dailyexpress.com.my/uploads/news2/2024/03/Pence_Trump_1703.jpg",
      "eventUri": "eng-9398913",
      "sentiment": 0.06666666666666665
    }
  }
}